maxim75/cc1101_receiver_esp32/src/main.cpp
/**
 * @file    main.cpp
 * @brief   ESP32-S3 + CC1101 + nRF24L01 dual RF receiver with SH1107 OLED display.
 *
 * CC1101  — receives OOK packets from an ATtiny3226 (ELECHOUSE SmartRC-compatible).
 * nRF24L01— receives 2.4 GHz packets on a dedicated HSPI bus.
 * Decoded packet details (hex, ASCII, RSSI where available) are shown on the OLED
 * and serial port.
 *
 * Libraries
 *   RadioLib  — jgromes/RadioLib   (CC1101)
 *   RF24      — nrf24/RF24          (nRF24L01)
 *   U8g2      — olikraus/U8g2
 *
 * Wiring
 *   Peripheral  Signal  ESP32-S3 GPIO
 *   ─────────────────────────────────
 *   CC1101      SCK     12  ┐
 *               MOSI    11  │ FSPI bus (SPI2)
 *               MISO    13  ┘
 *               CSN     10
 *               GDO0     2   (packet interrupt, RISING)
 *   nRF24L01    SCK     14  ┐
 *               MOSI     1  │ HSPI bus (SPI3)
 *               MISO    21  ┘
 *               CSN      6
 *               CE       5
 *               IRQ      4   (packet interrupt, FALLING)
 *   SH1107      SDA      8
 *               SCL      9
 *   All         VCC     3.3V
 *               GND     GND
 */

#include <RadioLib.h>
#include <RF24.h>
#include <nRF24L01.h>
#include <SPI.h>
#include <U8g2lib.h>

// ---------------------------------------------------------------------------
// Hardware configuration
// ---------------------------------------------------------------------------

namespace Pin {
    // FSPI bus (SPI2) — CC1101
    constexpr int SCK  = 12;
    constexpr int MISO = 13;
    constexpr int MOSI = 11;

    // CC1101
    constexpr int CC_CS   = 10;
    constexpr int CC_GDO0 =  2;

    // HSPI bus (SPI3) — nRF24L01
    constexpr int NRF_SCK  = 14;
    constexpr int NRF_MOSI =  1;
    constexpr int NRF_MISO = 21;

    // nRF24L01
    constexpr int NRF_CS  =  6;
    constexpr int NRF_CE  =  5;
    constexpr int NRF_IRQ =  4;

    // SH1107 (I2C)
    constexpr int OLED_SDA = 8;
    constexpr int OLED_SCL = 9;
}

namespace Radio {
    constexpr float   FREQUENCY_MHZ  = 433.92f;
    constexpr float   BITRATE_KBPS   =   4.8f;
    constexpr float   DEVIATION_KHZ  =   5.157f;
    constexpr float   RXBW_KHZ       = 203.0f;
    constexpr int     POWER_DBM      =  10;
    constexpr int     PREAMBLE_BITS  =  16;    // 2 bytes, CC1101 minimum
    constexpr uint8_t SYNC_BYTE_1    = 0xD3;
    constexpr uint8_t SYNC_BYTE_2    = 0x91;
}

namespace Nrf {
    constexpr uint64_t ADDRESS = 0xFAB7C2F0E2LL;  // must match transmitter
}

namespace Display {
    constexpr uint8_t WIDTH         = 128;
    constexpr uint8_t HEIGHT        = 128;
    constexpr int     HEX_MAX_BYTES =   7;    // bytes shown on OLED before "..."
}

// ---------------------------------------------------------------------------
// Peripherals
// ---------------------------------------------------------------------------
CC1101    cc1101 = new Module(Pin::CC_CS, Pin::CC_GDO0, RADIOLIB_NC, RADIOLIB_NC);
SPIClass  hspi(HSPI);
RF24      nrf24(Pin::NRF_CE, Pin::NRF_CS);

// SH1107 panels differ in column mapping; SEEED variant avoids left/right wrap artifacts.
U8G2_SH1107_SEEED_128X128_F_HW_I2C display(
    U8G2_R0, U8X8_PIN_NONE, Pin::OLED_SCL, Pin::OLED_SDA);

// ---------------------------------------------------------------------------
// Application state
// ---------------------------------------------------------------------------

struct PacketInfo {
    char     source[8]  = {};
    char     hex[48]    = {};
    char     ascii[22]  = {};
    float    rssi       = 0.0f;
    uint32_t count      = 0;
    bool     valid      = false;
    bool     hasRssi    = false;
};

static PacketInfo lastPacket;
static volatile bool cc1101Ready = false;

// ---------------------------------------------------------------------------
// ISRs
// ---------------------------------------------------------------------------

void IRAM_ATTR onCc1101Packet() { cc1101Ready = true; }

// ---------------------------------------------------------------------------
// Display helpers
// ---------------------------------------------------------------------------

static void drawCenteredText(uint8_t y, const char* text) {
    int16_t x = (Display::WIDTH - display.getStrWidth(text)) / 2;
    if (x < 0) x = 0;
    display.drawStr((uint8_t)x, y, text);
}

static void displaySplash(const char* line1, const char* line2 = nullptr) {
    display.clearBuffer();
    display.setFont(u8g2_font_6x10_tr);
    drawCenteredText(54, line1);
    if (line2) drawCenteredText(74, line2);
    display.sendBuffer();
}

static void displayPacket(const PacketInfo& pkt) {
    display.clearBuffer();
    display.setFont(u8g2_font_6x10_tr);

    // Header: source on left, packet counter on right
    display.drawStr(0, 12, pkt.valid ? pkt.source : "Dual RX");
    if (pkt.count > 0) {
        char counter[12];
        snprintf(counter, sizeof(counter), "#%lu", pkt.count);
        display.drawStr(Display::WIDTH - display.getStrWidth(counter), 12, counter);
    }
    display.drawHLine(0, 16, Display::WIDTH);

    if (!pkt.valid) {
        drawCenteredText(68, "Listening...");
    } else {
        constexpr uint8_t textX = 4;
        uint8_t y = 36;
        if (pkt.hasRssi) {
            char rssiLine[20];
            snprintf(rssiLine, sizeof(rssiLine), "RSSI: %.0f dBm", pkt.rssi);
            display.drawStr(textX, y, rssiLine);
            y += 20;
        }
        display.drawStr(textX, y, pkt.hex);   y += 20;

        char asciiLine[24];
        snprintf(asciiLine, sizeof(asciiLine), "\"%s\"", pkt.ascii);
        display.drawStr(textX, y, asciiLine);
    }

    display.sendBuffer();
}

// ---------------------------------------------------------------------------
// Radio helpers
// ---------------------------------------------------------------------------

static void buildHexString(const uint8_t* data, int len, char* out, size_t outSize) {
    out[0] = '\0';
    int shown = min(len, Display::HEX_MAX_BYTES);
    for (int i = 0; i < shown; i++) {
        char tmp[4];
        snprintf(tmp, sizeof(tmp), "%02X ", data[i]);
        strncat(out, tmp, outSize - strlen(out) - 1);
    }
    if (len > Display::HEX_MAX_BYTES) {
        strncat(out, "...", outSize - strlen(out) - 1);
    }
}

static void buildAsciiString(const uint8_t* data, int len, char* out, size_t outSize) {
    int maxChars = min(len, (int)(outSize - 1));
    for (int i = 0; i < maxChars; i++) {
        out[i] = isprint(data[i]) ? (char)data[i] : '.';
    }
    out[maxChars] = '\0';
}

static void fillPacket(PacketInfo& pkt, const char* source,
                       const uint8_t* buf, int len, float rssi, bool hasRssi) {
    pkt.count++;
    pkt.valid   = true;
    pkt.rssi    = rssi;
    pkt.hasRssi = hasRssi;
    strncpy(pkt.source, source, sizeof(pkt.source) - 1);
    pkt.source[sizeof(pkt.source) - 1] = '\0';
    buildHexString(buf, len, pkt.hex, sizeof(pkt.hex));
    buildAsciiString(buf, len, pkt.ascii, sizeof(pkt.ascii));
}

static void logPacketToSerial(const PacketInfo& pkt, const uint8_t* rawData, int len) {
    Serial.printf("── [%s] Packet %lu (%d bytes) ──────────\n", pkt.source, pkt.count, len);
    Serial.print("  Hex:   ");
    for (int i = 0; i < len; i++) Serial.printf("%02X ", rawData[i]);
    Serial.println();
    Serial.printf("  ASCII: \"%s\"\n", pkt.ascii);
    if (pkt.hasRssi) Serial.printf("  RSSI:  %.1f dBm\n", pkt.rssi);
    Serial.println("─────────────────────────────────────────\n");
}

// ---------------------------------------------------------------------------
// Arduino entry points
// ---------------------------------------------------------------------------

void setup() {
    Serial.begin(115200);
    // Wait up to 3 s for USB CDC host (ESP32-S3 native USB)
    for (uint32_t t = millis(); !Serial && (millis() - t < 3000); ) delay(10);

    // OLED up first so errors are visible on screen
    display.begin();
    displaySplash("Dual RX", "Initializing...");

    Serial.println("\n==============================");
    Serial.println("  ESP32-S3 Dual RF Receiver");
    Serial.println("==============================");

    SPI.begin(Pin::SCK, Pin::MISO, Pin::MOSI);
    hspi.begin(Pin::NRF_SCK, Pin::NRF_MISO, Pin::NRF_MOSI, Pin::NRF_CS);

    // --- CC1101 ---
    int state = cc1101.begin(
        Radio::FREQUENCY_MHZ,
        Radio::BITRATE_KBPS,
        Radio::DEVIATION_KHZ,
        Radio::RXBW_KHZ,
        Radio::POWER_DBM,
        Radio::PREAMBLE_BITS);

    if (state != RADIOLIB_ERR_NONE) {
        char errMsg[24];
        snprintf(errMsg, sizeof(errMsg), "CC1101 err: %d", state);
        Serial.printf("[ERROR] CC1101 init failed: %d\n", state);
        displaySplash("CC1101 FAILED", errMsg);
        while (true) delay(1000);
    }

    cc1101.setOOK(true);
    cc1101.setSyncWord(Radio::SYNC_BYTE_1, Radio::SYNC_BYTE_2);
    cc1101.setCrcFiltering(true);
    cc1101.setGdo0Action(onCc1101Packet, RISING);
    cc1101.startReceive();

    Serial.println("[OK] CC1101 ready");
    Serial.printf("  Frequency:  %.2f MHz\n",  Radio::FREQUENCY_MHZ);
    Serial.printf("  Data rate:  %.1f kbps\n", Radio::BITRATE_KBPS);
    Serial.printf("  Sync word:  0x%02X%02X\n", Radio::SYNC_BYTE_1, Radio::SYNC_BYTE_2);
    Serial.println("  Modulation: OOK | CRC: enabled");

    // --- nRF24L01 ---
    if (!nrf24.begin(&hspi)) {
        Serial.println("[ERROR] nRF24 init failed");
        displaySplash("nRF24 FAILED", "check wiring");
        while (true) delay(1000);
    }
    nrf24.setDataRate(RF24_250KBPS);
    nrf24.openReadingPipe(0, Nrf::ADDRESS);
    nrf24.setPALevel(RF24_PA_MAX, true);
    nrf24.startListening();

    Serial.println("[OK] nRF24 ready");
    Serial.printf("  Address:    0x%010llX\n", Nrf::ADDRESS);
    Serial.println("  Data rate:  250 kbps | PA: MAX");
    Serial.println("\n[LISTENING]\n");

    displayPacket(lastPacket);  // shows "Listening..."
}

void loop() {
    if (cc1101Ready) {
        cc1101Ready = false;

        const int len = cc1101.getPacketLength();
        if (len <= 0) { cc1101.startReceive(); return; }

        uint8_t buf[64];
        const int state = cc1101.readData(buf, len);
        cc1101.startReceive();

        if (state != RADIOLIB_ERR_NONE) {
            Serial.printf("[WARN] CC1101 readData error: %d\n", state);
            return;
        }

        fillPacket(lastPacket, "CC1101", buf, len, cc1101.getRSSI(), true);
        displayPacket(lastPacket);
        logPacketToSerial(lastPacket, buf, len);
    }

    if (nrf24.available()) {
        uint8_t buf[32] = {};
        uint8_t len = nrf24.getDynamicPayloadSize();
        if (len == 0 || len > sizeof(buf)) len = nrf24.getPayloadSize();
        if (len == 0 || len > sizeof(buf)) len = (uint8_t)sizeof(buf);
        nrf24.read(buf, len);

        fillPacket(lastPacket, "nRF24", buf, len, 0.0f, false);
        displayPacket(lastPacket);
        logPacketToSerial(lastPacket, buf, len);
    }
}
